 import * as Yup from "yup";

 const BookAddSchema = Yup.object().shape({
   title: Yup.string()
     .min(2, 'Назва книжки закоротка.')
     .max(150, 'Назва занадто довга.')
     .required('Введіть назву книжки.')
    .typeError("Введіть назву книжки від 2 до 150 символів."),
   author: Yup.string()
     .min(2, 'І\'мя автора закоротке.')
     .max(150, 'І\'мя автора занадто довге')
   .typeError("Введіть автора книжки від 2 до 150 символів."),
   year: Yup.number()
     .integer("Введіть ціле число.")
     .min(1000, "Ви читаєте манускрипт?")
     .max(2021, "Ця книжка ще не зявилась.")
   .typeError("Введите рік випуску книжки від 1000 до 2021 року."),
   pages: Yup.number("Введіть число")
     .integer("Введіть ціле число.")
     .positive("Кількість сторінок більше 1.")
     .min(1, "Кількість сторінок більше 1.")
     .max(99999, "Кількість сторінок менша 99999.")
     .required("Заповніть кількість сторінок.")
   .typeError("Введите кількість сторінок від 1 до 99999."),
 });

 export default BookAddSchema